brew "bat"
brew "eza"
brew "fd"
brew "python@3.13"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "openjdk"
brew "python-tk@3.12"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stylua"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
cask "adobe-acrobat-reader"
cask "chatgpt"
cask "discord"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "love"
cask "monitorcontrol"
cask "mos"
cask "mouseless@preview"
cask "postman"
cask "raycast"
cask "spotify"
cask "tomatobar"
cask "wezterm"
cask "whatsapp"
cask "zotero"
cask "zen-browser"
