tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
brew "bat"
brew "eza"
brew "fd"
brew "firefoxpwa"
brew "fish"
brew "fzf"
brew "git"
brew "lazygit"
brew "lua-language-server"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "yarn"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "iterm2"
cask "karabiner-elements"
