brew "bat"
brew "ctags"
brew "eza"
brew "fd"
brew "python@3.13"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lua"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "openjdk"
brew "pipx"
brew "poppler"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "stow"
brew "stylua"
brew "tmux"
brew "tree"
brew "typescript"
brew "typescript-language-server"
brew "yazi"
brew "zoxide"
brew "zsh"
cask "adobe-acrobat-reader"
cask "colemak-dh"
cask "copyq"
cask "discord"
cask "font-iosevka"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gimp"
cask "homerow"
cask "iterm2"
cask "karabiner-elements"
cask "love"
cask "monitorcontrol"
cask "mos"
cask "mouseless@preview"
cask "pycharm"
cask "raycast"
cask "spotify"
cask "tomatobar"
cask "wezterm"
cask "whatsapp"
cask "zotero"
