tap "nikitabobko/tap" # Aerospace
brew "bat"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh" # GitHub command-line tool
brew "python@3.13"
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "jq" # Lightweight and flexible command-line JSON processor
brew "lazygit"
brew "lua-language-server"
brew "neovim", args: ["HEAD"]
brew "node"
brew "openjdk"
brew "tcl-tk" # Tool Command Language
brew "qemu" # Generic machine emulator and virtualizer
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "stylua"
brew "telnet" # User interface to the TELNET protocol
brew "tmux"
brew "tree"
brew "typescript"
brew "typescript-language-server"
brew "typos-cli"
brew "typst"
brew "wget" # Internet file retriever
brew "woff2" # Utilities to create and convert Web Open Font File (WOFF) files
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
cask "aerospace"
cask "bitwarden"
cask "discord"
cask "ente-auth"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "love"
cask "microsoft-edge"
cask "monitorcontrol"
cask "mos"
cask "mouseless@preview"
cask "pearcleaner"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "stats"
cask "tomatobar"
cask "utm" # Virtual machines UI using QEMU
cask "wezterm"
cask "whatsapp"
cask "wireshark-app"
cask "zen"
cask "zotero"
