tap "nikitabobko/tap" # aerospace
brew "node"
brew "basedpyright" # pyright fork with various improvements and built-in pylance features
brew "bash-language-server"
brew "bat"
brew "curl" # get a file from an HTTP, HTTPS or FTP server
brew "eslint_d" # Speed up eslint to accelerate your development workflow
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh" # GitHub command-line tool
brew "git"
brew "google-java-format"
brew "hyperfine" # Command-line benchmarking tool
brew "jq" # Lightweight and flexible command-line JSON processor
brew "lazygit"
brew "llvm"
brew "lld"
brew "lua-language-server"
brew "neovim"
brew "prettierd"
brew "qemu" # Generic machine emulator and virtualizer
brew "ripgrep"
brew "ruff" # Extremely fast Python linter, written in Rust
brew "rust-analyzer"
brew "shfmt" # Autoformat shell script source code
brew "starship"
brew "stow"
brew "stylua"
brew "tailwindcss-language-server", link: false # LSP for TailwindCSS
brew "tmux"
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "tree-sitter-cli"
brew "vscode-langservers-extracted", link: false # Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "wget" # Internet file retriever
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
cask "aerospace"
cask "bitwarden"
cask "discord"
cask "ente-auth"
cask "font-jetbrains-mono-nerd-font"
cask "gimp"
cask "google-chrome"
cask "helium-browser"
cask "karabiner-elements"
cask "microsoft-edge"
cask "miniconda" # Minimal installer for conda
cask "monitorcontrol"
cask "mos"
cask "mouseless@preview"
cask "pearcleaner" # Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "wezterm"
cask "wireshark-app"
cask "zen"
cask "zotero"
cargo "emmylua_ls"
