tap "acsandmann/tap"
tap "nikitabobko/tap"
tap "tonisives/tap"
tap "y3owk1n/tap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Pyright fork with various improvements and built-in pylance features
brew "basedpyright"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# AST-based pattern checker for JavaScript
brew "eslint"
# Speed up eslint to accelerate your development workflow
brew "eslint_d"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# C++ mathematics library for graphics software
brew "glm"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Language server for the Go language
brew "gopls"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Extensible Cyclomatic Complexity Analyzer
brew "lizard-analyzer"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Language Server for the Lua language
brew "lua-language-server"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Development kit for the Java programming language
brew "openjdk@21", link: true
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Prettier daemon
brew "prettierd"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# LSP for TailwindCSS
brew "tailwindcss-language-server", link: false
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Vi 'workalike' with many additional features
brew "vim"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted", link: false
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Tiling window manager for macOS
brew "acsandmann/tap/rift"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Memory training application
cask "anki"
# Desktop password and login vault
cask "bitwarden"
# Voice and text chat software
cask "discord"
# Desktop client for Ente Auth
cask "ente-auth"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Chromium-based web browser
cask "helium-browser"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Multi-platform web browser
cask "microsoft-edge"
# Minimal installer for conda
cask "miniconda"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Mouse control with the keyboard
cask "mouseless@preview"
# Keyboard driven navigation for macOS
cask "y3owk1n/tap/neru"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# System-wide Vim mode for macOS
cask "tonisives/tap/ovim"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# To-do list
cask "todoist-app"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark-app"
# Gecko based web browser
cask "zen"
# Collect, organise, cite, and share research sources
cask "zotero"
cargo "emmylua_ls"
npm "@tailwindcss/language-server"
npm "@typescript/native-preview"
npm "pnpm"
npm "vscode-langservers-extracted"
